---
kind: property
id: P:Autodesk.Revit.DB.ElementOwnerViewFilter.ViewId
source: html/38f07408-d634-20bd-a7bf-7a3a266277e5.htm
---
# Autodesk.Revit.DB.ElementOwnerViewFilter.ViewId Property

The view id.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```